{
  "nodes": [
    {
      "key": "A",
      "category": "a",
      "label": "Jose Rizal's Retraction",
      "x": 0.0,
      "y": 0.0,
      "details": {
        "title": "Jose Rizal's Retraction",
        "content": "Rizal's retraction is interpreted in various ways. Some view it as a betrayal of his revolutionary ideals, while others suggest it was a strategic decision aimed at achieving peace for his family and countrymen. However, we in Group 3 align with the view that Rizal's retraction can be seen as a nuanced decision, reflecting both a personal journey and a response to the prevailing conditions in the Philippines.",
        "supporting_image_url": "https://pepealas.wordpress.com/wp-content/uploads/2019/12/nstp-2.jpg?w=640"
      }
    },
    {
      "key": "B. Historical Context",
      "category": "b",
      "label": "Historical Context",
      "x": -6,
      "y": 4,
      "details": {
        "title": "Historical Context",
        "content": "Discusses the socio-political background of the Philippines during Rizal's time and how it influenced his decisions.",
        "supporting_image_url": "https://i0.wp.com/utsynergyjournal.org/wp-content/uploads/2022/02/Exhibit-Rizal-Martyrdom-Botong-Francisco-1024x761-1.jpg?resize=678%2C381&ssl=1"
      }
    },
    {
      "key": "C. Religious Power and Influence of the Catholic Church",
      "category": "c",
      "label": "Religious Power and Influence of the Catholic Church",
      "x": -5,
      "y": 9.5,
      "details": {
        "title": "Religious Power and Influence of the Catholic Church",
        "content": "During the Spanish colonial era, the Catholic Church wielded immense power over Filipino society. Beyond spiritual guidance, the clergy held significant political and economic control, often acting as both religious leaders and government officials. Friars managed vast landholdings and imposed heavy taxes on the Filipino populace, creating widespread resentment. This power dynamic reinforced Spain’s colonial grip on the Philippines, making the Church a target of criticism by reformists like Jose Rizal, who saw its influence as a barrier to Filipino self-determination and enlightenment. Rizal's works, such as Noli Me Tangere and El Filibusterismo, directly challenged the clergy’s abuses, stirring both social and religious unrest.",
        "supporting_image_url": "https://sinaunangpanahon.com/wp-content/uploads/2023/09/Spanish-Friars-in-the-Philippines-1024x585.jpg"
      }
    },
    {
      "key": "C. Masonry",
      "category": "c",
      "label": "Masonry",
      "x": -7.5,
      "y": 9.5,
      "details": {
        "title": "Masonry",
        "content": "Masonry, or Freemasonry, played a key role in the Philippine reform movement by promoting ideals of liberty, equality, and fraternity. Filipino reformists, including Jose Rizal, joined Masonic lodges to oppose Spanish colonial rule and the Church's influence. The Church viewed Masonry as a threat due to its secular values and opposition to clerical power. Rizal’s affiliation with Masonry and his reforms led to tensions with the Church, which pressured him to renounce Masonry as part of his retraction before his execution.",
        "supporting_image_url": "https://www.philippinemasonry.org/uploads/6/5/4/0/6540709/rizal-s-reinternment-2_orig.png"
      }
    },
    {
      "key": "C. Emergence of Filipino Nationalism",
      "category": "c",
      "label": "Emergence of Filipino Nationalism",
      "x": -10,
      "y": 9.5,
      "details": {
        "title": "Emergence of Filipino Nationalism",
        "content": "Filipino nationalism began to take shape in the late 19th century as a response to the abuses and oppression of Spanish colonial rule. Intellectuals and reformists, inspired by the Enlightenment and the ideals of freedom and equality, began to advocate for political and social change. Jose Rizal, along with other reformists like Andres Bonifacio and Emilio Aguinaldo, challenged Spanish authority through writings, revolutionary acts, and calls for independence. The execution of Rizal in 1896 further galvanized the movement, inspiring Filipinos to unite in their struggle for sovereignty and self-determination, ultimately leading to the Philippine Revolution and the birth of the nation.",
        "supporting_image_url": "https://historylearning.com/fileadmin/_processed_/1/e/csm_Calatagan_Batangasjf0480_17_891f6dc4bb.jpg"
      }
    },
    {
      "key": "C. Colonial Oppression by Spain",
      "category": "c",
      "label": "Colonial Oppression by Spain",
      "x": -12,
      "y": 2.5,
      "details": {
        "title": "Colonial Oppression by Spain",
        "content": "Spanish colonial rule in the Philippines (1565–1898) was marked by widespread oppression and exploitation. The Spanish government and the Catholic Church controlled nearly every aspect of Filipino life, from politics and economy to religion and education. The clergy held immense power, often abusing their authority over the people, imposing heavy taxes, and controlling land. The indigenous population was subjected to forced labor, military service, and harsh treatment. Social and political freedoms were severely restricted, and Filipinos were denied meaningful representation. This oppression led to growing resentment, which sparked the Philippine Revolution and the eventual fight for independence.",
        "supporting_image_url": "https://pm1.aminoapps.com/7508/a1091c0cf95627db648c4578cd6d90df61d869e2r1-450-378v2_uhq.jpg"
      }
    },
    {
      "key": "C. Outbreak of Philippine Revolution",
      "category": "c",
      "label": "Outbreak of Philippine Revolution",
      "x": -12,
      "y": 4.5,
      "details": {
        "title": "Outbreak of Philippine Revolution",
        "content": "The Philippine Revolution began in 1896 in response to Spanish colonial oppression. The execution of Jose Rizal sparked widespread anger, fueling the Katipunan, a revolutionary group led by Andres Bonifacio. The movement aimed for independence from Spanish rule, driven by resentment over government and church abuses. Armed uprisings spread across the country, eventually leading to the establishment of the First Philippine Republic and the end of Spanish colonization.",
        "supporting_image_url": "https://www.niceartgallery.com/imgs/4212215/l/jorge-pineda-study-in-oil-on-canvas-for-the-philippine-revolution-323e507b.jpg"
      }
    },
    {
      "key": "C. Rizal's Arrest and Trial",
      "category": "c",
      "label": "Rizal's Arrest and Trial",
      "x": -12,
      "y": 8.5,
      "details": {
        "title": "Rizal's Arrest and Trial",
        "content": "Jose Rizal was arrested on December 11, 1896, after being accused of inciting rebellion against Spanish rule through his writings, particularly his novels Noli Me Tangere and El Filibusterismo. Although he advocated for reforms and not outright revolution, the Spanish authorities considered him a threat. Rizal was tried by a military court, where he was found guilty of sedition and sentenced to death. Despite his peaceful stance and opposition to violence, Rizal was executed by firing squad on December 30, 1896, in Bagumbayan (now Luneta), becoming a martyr and a symbol of Filipino nationalism.",
        "supporting_image_url": "https://xiaochua.net/wp-content/uploads/2012/12/05-630-ng-umaga-nang-simulan-ni-rizal-at-ng-mga-kasama-ang-paglakad-patungo-sa-luneta-de-bagumabayan.jpg?w=584"
      }
    },
    {
      "key": "C. Jesuit Influence on Rizal",
      "category": "c",
      "label": "Jesuit Influence on Rizal",
      "x": -12,
      "y": 6.5,
      "details": {
        "title": "Jesuit Influence on Rizal",
        "content": "The Jesuits greatly influenced Jose Rizal during his education at Ateneo Municipal de Manila, where he excelled in academics and developed his intellectual foundations. His Jesuit professors, especially Fr. Francisco de Paula Sánchez, encouraged his scholarly pursuits and writings. Despite later conflicts with the Church, Rizal valued the Jesuits for their role in shaping his early education and intellectual growth.",
        "supporting_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTMCwf0wtxQWuqtHgTE8_zECKuK3ChI4N8CEw&s"
      }
    },
    {
      "key": "C. Rizal's Activism",
      "category": "c",
      "label": "Rizal's Activism",
      "x": -9,
      "y": 6.5,
      "details": {
        "title": "Rizal's Activism",
        "content": "Rizal was a prominent Filipino nationalist and writer who vocally criticized the Spanish colonial regime. His novels, Noli Me Tangere and El Filibusterismo exposed the abuses of the colonial system and ignited a spark of nationalism.",
        "supporting_image_url": "https://eyeofthetiger25.wordpress.com/wp-content/uploads/2016/02/2012b-noli_me_tangere.jpg"
      }
    },
    {
      "key": "B. Key Evidences",
      "category": "b",
      "label": "Key Evidences",
      "x": -6.0,
      "y": -4.0,
      "details": {
        "title": "Key Evidences",
        "content": "Includes important evidences about how Jose Rizal retracted.",
        "supporting_image_url": "https://pepealas.wordpress.com/wp-content/uploads/2019/12/nstp-2.jpg?w=640"
      }
    },
    {
      "key": "C. Document of Retraction",
      "category": "c",
      "label": "Document of Retraction",
      "x": -5.0,
      "y": -9.5,
      "details": {
        "title": "Document of Retraction",
        "content": "Father Manuel Garcia, C.M discovered the document containing the retraction letter in archdiocesan archives on May 18, 1935, after the execution of Jose Rizal on December 30 ,1896.",
        "supporting_image_url": "https://pepealas.wordpress.com/wp-content/uploads/2019/12/nstp-2.jpg?w=640"
      }
    },
    {
      "key": "C. Publication and Official Reports",
      "category": "c",
      "label": "Publication and Official Reports",
      "x": -7.5,
      "y": -9.5,
      "details": {
        "title": "Publication and Official Reports",
        "content": "Various publications and official reports from the time of José Rizal's execution support the idea that he retracted his previous beliefs. Newspapers and accounts from witnesses, including Jesuits and colonial officials, reported that Rizal publicly expressed his return to Catholicism shortly before his death. These reports highlighted key actions, such as his confession, communion, and the signing of the retraction document.",
        "supporting_image_url": "https://pepealas.wordpress.com/wp-content/uploads/2019/12/nstp-2.jpg?w=640"
      }
    },
    {
      "key": "C. Fr. Balaguer's Memoirs",
      "category": "c",
      "label": "Fr. Balaguer's Memoirs",
      "x": -10,
      "y": -9.5,
      "details": {
        "title": "Fr. Balaguer's Memoirs",
        "content": "Balaguer describes how he encouraged Rizal to renounce Masonry and return to the Catholic Church. According to Balaguer, Rizal expressed remorse for his previous anti-Catholic beliefs and agreed to retract them. These memoirs serve as an important pro-retraction source, as they provide firsthand testimony of Rizal’s conversations and actions that suggest a genuine return to the faith. The sincerity of Rizal’s retraction, as outlined in Balaguer’s writings, remains a cornerstone of the argument supporting the authenticity of the retraction document."
      }
    },
    {
      "key": "C. Mi Ultimo Adios’s Lack of Explicit Retraction",
      "category": "c",
      "label": "Mi Ultimo Adios’s Lack of Explicit Retraction",
      "x": -12,
      "y": -8.5,
      "details": {
        "title": "Mi Ultimo Adios’s Lack of Explicit Retraction",
        "content": "José Rizal's in articulo mortis (deathbed) marriage to Josephine Bracken on the eve of his execution is seen as a significant act of spiritual and personal reconciliation. The marriage, performed without witnesses or sponsors, was a private ceremony that reflected Rizal’s return to Catholic practices. This last-minute act, along with his confession and communion, strengthens the argument for his retraction. By marrying in the Catholic faith just hours before his death, Rizal demonstrated his commitment to the Church, reinforcing the view that his retraction was sincere and part of his final spiritual journey.",
        "supporting_image_url": "https://rizal.raphaelmarco.com/static/files/literatures/mi-ultimo-adios.jpg"
      }
    },
    {
      "key": "C. In Articulo Mortis Marriage",
      "category": "c",
      "label": "In Articulo Mortis Marriage",
      "x": -12.0,
      "y": -2.5,
      "details": {
        "title": "In Articulo Mortis Marriage",
        "content": "Rizal’s marriage to Josephine Bracken in a Catholic ceremony just before his death indicates his reconciliation with the Church. Catholic doctrine at the time would have required Rizal to retract his criticisms and return to the faith to receive the sacrament of marriage.",
        "supporting_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTZ9_pFpWqJkgm7H6dsYXoW8qUJgD0JRXQrHQ&s"
      }
    },

    {
      "key": "C. Confession and Communion",
      "category": "c",
      "label": "Confession and Communion",
      "x": -12.0,
      "y": -4.5,
      "details": {
        "title": "Confession and Communion",
        "content": "On the day of his execution, Jose Rizal underwent confession and received communion, acts that were seen as a reaffirmation of his Catholic faith. Father Vicente Balaguer, a Jesuit priest, administered the sacrament, and Rizal's participation in these rituals was interpreted by some as evidence of his retraction from his previous anti-Catholic beliefs. ",
        "supporting_image_url": "https://mgctopinio.wordpress.com/wp-content/uploads/2019/10/rizal_confession.jpg?w=357"
      }
    },

    {
      "key": "C. Acts of Faith, Hope, and Charity",
      "category": "c",
      "label": "Acts of Faith, Hope, and Charity",
      "x": -12.0,
      "y": -6.5,
      "details": {
        "title": "Acts of Faith, Hope, and Charity",
        "content": "Rizal's recitation of the Acts of Faith, Hope, and Charity marked a profound spiritual moment. These Catholic prayers, symbolizing devotion and trust in God, are seen as key evidence of his reversion to the Catholic faith. Along with his confession and communion, these acts suggest that Rizal's spiritual reconciliation was not only genuine but part of his decision to retract his earlier anti-Catholic views. His final actions point to a sincere desire to die in the grace of the Church, solidifying the belief that his retraction was authentic.",
        "supporting_image_url": "https://rizal.raphaelmarco.com/static/files/sculptures/image-of-virgin-mary.jpg"
      }
    },
    {
      "key": "B. Key Resources",
      "category": "b",
      "label": "Key Resources",
      "x": 6.0,
      "y": 4.0,
      "details": {
        "title": "Key Resources",
        "content": "Includes important resources who were involved in his retraction.",
        "supporting_image_url": "https://mgctopinio.wordpress.com/wp-content/uploads/2019/10/rizal_confession.jpg?w=357"
      }
    },
    {
      "key": "C. Jesuit's Version",
      "category": "c",
      "label": "Jesuit's Version",
      "x": 6.0,
      "y": 9.5,
      "details": {
        "title": "Jesuit's Version",
        "content": "Jesuit priests, particularly Fr. Vicente Balaguer, were instrumental in Rizal's spiritual reconciliation. According to this version, Rizal initially hesitated to sign the retraction document but ultimately agreed after several discussions with the Jesuits. These accounts indicate that Rizal renounced Masonry and reaffirmed his Catholic faith, expressing his desire to die as a Catholic. Several Jesuits, who were present during Rizal's last moments, provided testimonies supporting this narrative.",
        "supporting_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTMCwf0wtxQWuqtHgTE8_zECKuK3ChI4N8CEw&s"
      }
    },
    {
      "key": "C. Cuerpo De Vigilancia",
      "category": "c",
      "label": "Cuerpo De Vigilancia",
      "x": 12.0,
      "y": 2.5,
      "details": {
        "title": "Cuerpo De Vigilancia",
        "content": "Federico Moreno, a non-Catholic and non-Mason, offered a report that contrasted with the Jesuit narratives, presenting a less biased perspective on Rizal's actions before his execution. According to Moreno’s report, Rizal was visited by Jesuits but did not immediately accept their retraction document. In the afternoon, Rizal reportedly handed a different document to Father March, which was signed as his retraction. Moreno’s account also emphasized Rizal's religious acts, such as his confession and communion, suggesting a return to Catholicism.",
        "supporting_image_url": "https://figures.semanticscholar.org/50ede07a185a471b0cc73af1a9f4b1c440e1f30d/20-Figure3-1.png"
      }
    },
    {
      "key": "B. Key Figures",
      "category": "b",
      "label": "Key Figures",
      "x": 6,
      "y": -4,
      "details": {
        "title": "Key Figures",
        "content": "Includes important individuals like Rizal, his family, and political associates who were involved in his retraction.",
        "supporting_image_url": "https://mgctopinio.wordpress.com/wp-content/uploads/2019/10/rizal_confession.jpg?w=357"
      }
    },
    {
      "key": "C. Federico Moreno",
      "category": "c",
      "label": "Federico Moreno",
      "x": 12.0,
      "y": -2.5,
      "details": {
        "title": "Federico Moreno",
        "content": "A member of the Cuerpo de Vigilancia and a non-Catholic, Moreno provided a neutral and objective account of Rizal's execution. Unlike the Jesuits, who had a vested interest in the retraction narrative, Moreno's report is considered more impartial, as he had no direct ties to the Church or the Masonic community. In his memoirs, he described Rizal’s interactions with the Jesuits and his spiritual acts, including confession and communion. "
      }
    },
    {
      "key": "C. Archbishop Bernadino Nozaleda",
      "category": "c",
      "label": "Archbishop Bernadino Nozaleda",
      "x": 12.0,
      "y": -4.5,
      "details": {
        "title": "Archbishop Bernadino Nozaleda",
        "content": "Archbishop Bernardino Nozaleda was a significant figure in the religious context surrounding José Rizal's final days. As the Archbishop of Manila, Nozaleda played a pivotal role in the efforts to convert Rizal back to the Catholic faith before his execution. He requested that Jesuit priests provide spiritual guidance to Rizal, recognizing the importance of the moment for both the Church and Rizal’s soul. Nozaleda’s involvement highlights the Catholic Church's influence in the final hours of the national hero, as the Jesuits, at his behest, worked to facilitate Rizal's retraction. ",
        "supporting_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSUa8TwIuZ3OdcdEODeLlr7Z51nkab2I7EnRg&s"
      }
    },
    {
      "key": "C. Fr. Estanislao March",
      "category": "c",
      "label": "Fr. Estanislao March",
      "x": 10.0,
      "y": -4.5,
      "details": {
        "title": "Fr. Estanislao March",
        "content": "As one of the key Jesuit figures involved in Rizal's conversion, Fr. March was present at the prison and engaged in discussions with Rizal about religion and the retraction. He heard Rizal's confession and administered communion to him shortly before the execution, marking a significant moment of spiritual reconciliation. Fr. March's involvement is often highlighted in Jesuit accounts of Rizal's last hours, reinforcing the narrative that Rizal did indeed retract his anti-Catholic beliefs and returned to the Church."
      }
    },
    {
      "key": "C. Fr. Manuel Garcia",
      "category": "c",
      "label": "Fr. Manuel Garcia",
      "x": 9.5,
      "y": -6.5,
      "details": {
        "title": "Fr. Manuel Garcia",
        "content": "Garcia was a close associate of the Jesuits and one of the individuals who witnessed Rizal's final days. He was part of the entourage involved in the events surrounding Rizal’s reported retraction, and his testimony is often referenced in relation to the Catholic narrative of Rizal's return to the Church. Garcia’s observations on Rizal’s spiritual acts, including confession, communion, and the act of kissing the image of the Virgin Mary, were important in shaping the accounts that support the retraction story."
      }
    },
    {
      "key": "C. Josephine Bracken",
      "category": "c",
      "label": "Josephine Bracken",
      "x": 12.0,
      "y": -6.5,
      "details": {
        "title": "Josephine Bracken",
        "content": "An Irishwoman who had been living in the Philippines, she became close to Rizal and is often described as his common-law wife. Bracken's relationship with Rizal has been the subject of much debate, with some sources suggesting she played a role in his emotional and spiritual life during his imprisonment. On the day before his execution, Bracken was present during Rizal's last moments and was even married to him in a deathbed ceremony, the in articulo mortis marriage. This act, which took place without official witnesses or sponsors, is seen as a symbolic return to Catholic rites, further solidifying the narrative of Rizal's spiritual reconciliation.",
        "supporting_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTiz3JuPgd0P9px7k65BxzkNwSfu2ZoRJ_TjA&s"
      }
    },
    {
      "key": "C. Fr. Pio Pi",
      "category": "c",
      "label": "Fr. Pio Pi",
      "x": 11.5,
      "y": -8.5,
      "details": {
        "title": "Fr. Pio Pi",
        "content": "The Jesuit superior who, upon the request of Archbishop Bernardino Nozaleda, took responsibility for overseeing Rizal's spiritual guidance before his execution. Fr. Pi was instrumental in facilitating the discussions between Rizal and the Jesuits regarding his retraction. He was a key figure in the efforts to convince Rizal to renounce his anti-Catholic beliefs and return to the Church. Fr. Pi's involvement is often cited in Jesuit accounts as part of the religious preparation that led to Rizal’s confession, communion, and supposed retraction. "
      }
    },
    {
      "key": "C. Fr. Vicente Balaguer",
      "category": "c",
      "label": "Fr. Vicente Balaguer",
      "x": 5.0,
      "y": -9.5,
      "details": {
        "title": "Fr. Vicente Balaguer",
        "content": "Fr. Vicente Balaguer is a Jesuit priest who claimed that he conveyed to convince Rizal to denounce Masonry and return to Catholic fold. He is said to have been a witness to the signing of the retraction letter. He reportedly accompanied Rizal during his last hours and claimed that Rizal had repented and returned to the Church."
      }
    },
    {
      "key": "C. Jose Rizal",
      "category": "c",
      "label": "Jose Rizal",
      "x": 7.5,
      "y": -9.5,
      "details": {
        "title": "Jose Rizal",
        "content": "Jose Rizal is regarded as The National Hero of the Philippines, his writings which were controversial during the time,  Noli me Tangere and El Filibusterismo sparked the revolution as it opened his fellow countrymen to the oppression of the Spanish. He was a revolutionary that fought with his pen and showed his love for his country through his writings. He was also a member of the Masonry, a brotherhood whose ideas opposed the Catholic church. ",
        "supporting_image_url": "https://dragonflycollector.com/wp-content/uploads/2010/12/rizal-jose.jpg?w=233"
      }
    },
    {
      "key": "C. Fr. Jose Vilaclara",
      "category": "c",
      "label": "Fr. Jose Vilaclara",
      "x": 7.5,
      "y": -7.5,
      "details": {
        "title": "Fr. Jose Vilaclara",
        "content": "ilaclara was involved in attempts to bring Rizal back to the Catholic faith, a central goal of the Jesuit clergy leading up to Rizal's execution.Fr. Vilaclara's role in Rizal's spiritual care was part of the Jesuit mission to influence Rizal to retract his anti-Catholic writings and embrace Catholicism once again. Although specific details of his interactions with Rizal remain somewhat unclear, his participation is consistent with the efforts of Jesuit priests such as Fr. Vicente Balaguer, Fr. Pio Pi, and others, who sought to persuade Rizal to renounce his previous beliefs."
      }
    },
    {
      "key": "C. Fr. Rufino Collantes",
      "category": "c",
      "label": "Fr. Rufino Collantes",
      "x": 9.5,
      "y": -9.5,
      "details": {
        "title": "Fr. Rufino Collantes",
        "content": "Father Rufino Collantes baptized Jose Rizal on June 22, 1861 at the Saint John the Baptist Parish Church in Calamba. Given that Jose Rizal has a religious background it likely played a role in shaping his moral values, thoughts, and understanding of Catholic teachings.",
        "supporting_image_url": "https://scontent.fmnl37-1.fna.fbcdn.net/v/t1.15752-9/434616454_1085590785860270_3110545328721662875_n.png?_nc_cat=106&ccb=1-7&_nc_sid=9f807c&_nc_eui2=AeH-MDjx3n_EJERAVBnzJpbTvlOZA-Rr63i-U5kD5GvreAZPmxjuUFn79lXJZXvJG6EvP0EGCHITvyafjqOMDYer&_nc_ohc=0OmKksfv95UQ7kNvgH6nBLp&_nc_zt=23&_nc_ht=scontent.fmnl37-1.fna&oh=03_Q7cD1QE5MDtqTSFPCZdjmtWlaRN-70fmzWvos5CactK89NV7_Q&oe=675695B3"
      }
    }
  ],
  "edges": [
    {
      "id": "EA",
      "category": "a",
      "source": "A",
      "target": "B. Historical Context"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Historical Context",
      "target": "C. Colonial Oppression by Spain"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Historical Context",
      "target": "C. Outbreak of Philippine Revolution"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Historical Context",
      "target": "C. Rizal's Activism"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Historical Context",
      "target": "C. Jesuit Influence on Rizal"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Historical Context",
      "target": "C. Rizal's Arrest and Trial"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Historical Context",
      "target": "C. Emergence of Filipino Nationalism"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Historical Context",
      "target": "C. Masonry"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Historical Context",
      "target": "C. Religious Power and Influence of the Catholic Church"
    },
    {
      "id": "EA",
      "category": "a",
      "source": "A",
      "target": "B. Key Figures"
    },
    {
      "id": "EA",
      "category": "a",
      "source": "A",
      "target": "B. Key Evidences"
    },
    {
      "id": "EA",
      "category": "a",
      "source": "A",
      "target": "B. Key Resources"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Resources",
      "target": "C. Jesuit's Version"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Resources",
      "target": "C. Cuerpo De Vigilancia"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Figures",
      "target": "C. Federico Moreno"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Cuerpo De Vigilancia",
      "target": "C. Federico Moreno"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Figures",
      "target": "C. Fr. Vicente Balaguer"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Jesuit's Version",
      "target": "C. Fr. Vicente Balaguer"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Jesuit's Version",
      "target": "C. Fr. Estanislao March"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Jesuit's Version",
      "target": "C. Archbishop Bernadino Nozaleda"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Jesuit's Version",
      "target": "C. Fr. Jose Vilaclara"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Jesuit's Version",
      "target": "C. Fr. Pio Pi"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Cuerpo De Vigilancia",
      "target": "C. Fr. Vicente Balaguer"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Jesuit's Version",
      "target": "C. Josephine Bracken"
    },

    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Figures",
      "target": "C. Fr. Jose Vilaclara"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Figures",
      "target": "C. Fr. Estanislao March"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Figures",
      "target": "C. Fr. Manuel Garcia"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Figures",
      "target": "C. Jose Rizal"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Figures",
      "target": "C. Fr. Rufino Collantes"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Figures",
      "target": "C. Fr. Pio Pi"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Figures",
      "target": "C. Josephine Bracken"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Figures",
      "target": "C. Archbishop Bernadino Nozaleda"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Evidences",
      "target": "C. Document of Retraction"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Evidences",
      "target": "C. In Articulo Mortis Marriage"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Jesuit's Version",
      "target": "C. In Articulo Mortis Marriage"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Evidences",
      "target": "C. Confession and Communion"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Evidences",
      "target": "C. Acts of Faith, Hope, and Charity"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Evidences",
      "target": "C. Mi Ultimo Adios’s Lack of Explicit Retraction"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Evidences",
      "target": "C. Fr. Balaguer's Memoirs"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Jesuit's Version",
      "target": "C. Fr. Balaguer's Memoirs"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Cuerpo De Vigilancia",
      "target": "C. Fr. Balaguer's Memoirs"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Cuerpo De Vigilancia",
      "target": "C. Confession and Communion"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Cuerpo De Vigilancia",
      "target": "C. Acts of Faith, Hope, and Charity"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Cuerpo De Vigilancia",
      "target": "C. Document of Retraction"
    },
    {
      "id": "EC",
      "category": "c",
      "source": "C. Jesuit's Version",
      "target": "C. Document of Retraction"
    },
    {
      "id": "EB",
      "category": "b",
      "source": "B. Key Evidences",
      "target": "C. Publication and Official Reports"
    }
  ]
}
